Revit 2026 API

# ContourSettingItemType Enumeration

---

The type of a ContourSettingItem

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ContourSettingItemType
```
```vb
Public Enumeration ContourSettingItemType
```
```cpp
public enum class ContourSettingItemType
```
```fsharp
type ContourSettingItemType
```

| Member name | Value | Description |
| --- | --- | --- |
| BoundedRange | 2 | The item contains contour lines in a bounded range. |
| Single | 0 | The item only contains a single contour line. |
| UnboundedRange | 1 | The item contains contour lines in an unbounded range. |

#### Reference

Autodesk.Revit.DB Namespace